Revit 2024 API
AnalysisDisplayStyleVectorOrientation Enumeration
 Defines vector orientation for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum AnalysisDisplayStyleVectorOrientation
Visual Basic
Public Enumeration AnalysisDisplayStyleVectorOrientation
Visual C++
public enum class AnalysisDisplayStyleVectorOrientation
Members
Member name | Description
Linear
ArcAroundVectorAxis
See Also
Autodesk.Revit.DB.Analysis Namespace